<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Pengantar" data-toc-modified-id="Pengantar-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Pengantar</a></span><ul class="toc-item"><li><span><a href="#Libraries" data-toc-modified-id="Libraries-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Libraries</a></span><ul class="toc-item"><li><span><a href="#Install-libraries" data-toc-modified-id="Install-libraries-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>Install libraries</a></span></li><li><span><a href="#Cara-memanggil-library" data-toc-modified-id="Cara-memanggil-library-1.1.2"><span class="toc-item-num">1.1.2&nbsp;&nbsp;</span>Cara memanggil library</a></span></li></ul></li></ul></li><li><span><a href="#Pandas-üêº" data-toc-modified-id="Pandas-üêº-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Pandas üêº</a></span><ul class="toc-item"><li><span><a href="#Rekomendasi-bacaan" data-toc-modified-id="Rekomendasi-bacaan-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Rekomendasi bacaan</a></span></li><li><span><a href="#Import-Pandas" data-toc-modified-id="Import-Pandas-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Import Pandas</a></span></li><li><span><a href="#Series-dan-DataFrame" data-toc-modified-id="Series-dan-DataFrame-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Series dan DataFrame</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-2.3.1"><span class="toc-item-num">2.3.1&nbsp;&nbsp;</span>Series</a></span><ul class="toc-item"><li><span><a href="#index" data-toc-modified-id="index-2.3.1.1"><span class="toc-item-num">2.3.1.1&nbsp;&nbsp;</span>index</a></span></li><li><span><a href="#Value" data-toc-modified-id="Value-2.3.1.2"><span class="toc-item-num">2.3.1.2&nbsp;&nbsp;</span>Value</a></span></li><li><span><a href="#Method-dan-Atribut-lainnya" data-toc-modified-id="Method-dan-Atribut-lainnya-2.3.1.3"><span class="toc-item-num">2.3.1.3&nbsp;&nbsp;</span>Method dan Atribut lainnya</a></span></li><li><span><a href="#Series-vs-List" data-toc-modified-id="Series-vs-List-2.3.1.4"><span class="toc-item-num">2.3.1.4&nbsp;&nbsp;</span>Series vs List</a></span></li><li><span><a href="#Operasi-Dasar" data-toc-modified-id="Operasi-Dasar-2.3.1.5"><span class="toc-item-num">2.3.1.5&nbsp;&nbsp;</span>Operasi Dasar</a></span></li></ul></li><li><span><a href="#Dataframe" data-toc-modified-id="Dataframe-2.3.2"><span class="toc-item-num">2.3.2&nbsp;&nbsp;</span>Dataframe</a></span></li></ul></li><li><span><a href="#Read-Data" data-toc-modified-id="Read-Data-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>Read Data</a></span><ul class="toc-item"><li><span><a href="#CSV" data-toc-modified-id="CSV-2.4.1"><span class="toc-item-num">2.4.1&nbsp;&nbsp;</span>CSV</a></span><ul class="toc-item"><li><span><a href="#Import-Sederhana" data-toc-modified-id="Import-Sederhana-2.4.1.1"><span class="toc-item-num">2.4.1.1&nbsp;&nbsp;</span>Import Sederhana</a></span></li><li><span><a href="#Import-dengan-arguments" data-toc-modified-id="Import-dengan-arguments-2.4.1.2"><span class="toc-item-num">2.4.1.2&nbsp;&nbsp;</span>Import dengan arguments</a></span></li></ul></li><li><span><a href="#Excel" data-toc-modified-id="Excel-2.4.2"><span class="toc-item-num">2.4.2&nbsp;&nbsp;</span>Excel</a></span></li><li><span><a href="#JSON" data-toc-modified-id="JSON-2.4.3"><span class="toc-item-num">2.4.3&nbsp;&nbsp;</span>JSON</a></span></li><li><span><a href="#SQL" data-toc-modified-id="SQL-2.4.4"><span class="toc-item-num">2.4.4&nbsp;&nbsp;</span>SQL</a></span></li><li><span><a href="#Summarizing-Data" data-toc-modified-id="Summarizing-Data-2.4.5"><span class="toc-item-num">2.4.5&nbsp;&nbsp;</span>Summarizing Data</a></span></li></ul></li><li><span><a href="#Data-Selection" data-toc-modified-id="Data-Selection-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>Data Selection</a></span><ul class="toc-item"><li><span><a href="#Mengambil-seluruh-baris-dari-sebagian-kolom-(row-slicing)" data-toc-modified-id="Mengambil-seluruh-baris-dari-sebagian-kolom-(row-slicing)-2.5.1"><span class="toc-item-num">2.5.1&nbsp;&nbsp;</span>Mengambil seluruh baris dari sebagian kolom (row slicing)</a></span></li><li><span><a href="#Mengambil-seluruh-kolom-dari-sebagian-baris-(columns-slicing)" data-toc-modified-id="Mengambil-seluruh-kolom-dari-sebagian-baris-(columns-slicing)-2.5.2"><span class="toc-item-num">2.5.2&nbsp;&nbsp;</span>Mengambil seluruh kolom dari sebagian baris (columns slicing)</a></span></li><li><span><a href="#Mengambil-sebagian-baris-pada-sebagian-kolom-(row-column-slicing)" data-toc-modified-id="Mengambil-sebagian-baris-pada-sebagian-kolom-(row-column-slicing)-2.5.3"><span class="toc-item-num">2.5.3&nbsp;&nbsp;</span>Mengambil sebagian baris pada sebagian kolom (row-column slicing)</a></span></li><li><span><a href="#Loc-dan-Iloc" data-toc-modified-id="Loc-dan-Iloc-2.5.4"><span class="toc-item-num">2.5.4&nbsp;&nbsp;</span>Loc dan Iloc</a></span><ul class="toc-item"><li><span><a href="#.loc" data-toc-modified-id=".loc-2.5.4.1"><span class="toc-item-num">2.5.4.1&nbsp;&nbsp;</span>.loc</a></span></li><li><span><a href="#.iloc" data-toc-modified-id=".iloc-2.5.4.2"><span class="toc-item-num">2.5.4.2&nbsp;&nbsp;</span>.iloc</a></span></li></ul></li><li><span><a href="#Filtering-data" data-toc-modified-id="Filtering-data-2.5.5"><span class="toc-item-num">2.5.5&nbsp;&nbsp;</span>Filtering data</a></span><ul class="toc-item"><li><span><a href="#Conditional" data-toc-modified-id="Conditional-2.5.5.1"><span class="toc-item-num">2.5.5.1&nbsp;&nbsp;</span>Conditional</a></span></li><li><span><a href="#Query" data-toc-modified-id="Query-2.5.5.2"><span class="toc-item-num">2.5.5.2&nbsp;&nbsp;</span>Query</a></span></li></ul></li></ul></li><li><span><a href="#Sorting-Data" data-toc-modified-id="Sorting-Data-2.6"><span class="toc-item-num">2.6&nbsp;&nbsp;</span>Sorting Data</a></span></li><li><span><a href="#Data-Manipulation" data-toc-modified-id="Data-Manipulation-2.7"><span class="toc-item-num">2.7&nbsp;&nbsp;</span>Data Manipulation</a></span><ul class="toc-item"><li><span><a href="#Drop-Row-or-Columns" data-toc-modified-id="Drop-Row-or-Columns-2.7.1"><span class="toc-item-num">2.7.1&nbsp;&nbsp;</span>Drop Row or Columns</a></span><ul class="toc-item"><li><span><a href="#Menghapus-Kolom" data-toc-modified-id="Menghapus-Kolom-2.7.1.1"><span class="toc-item-num">2.7.1.1&nbsp;&nbsp;</span>Menghapus Kolom</a></span></li><li><span><a href="#Menghapus-Baris" data-toc-modified-id="Menghapus-Baris-2.7.1.2"><span class="toc-item-num">2.7.1.2&nbsp;&nbsp;</span>Menghapus Baris</a></span></li></ul></li><li><span><a href="#Missing-Values" data-toc-modified-id="Missing-Values-2.7.2"><span class="toc-item-num">2.7.2&nbsp;&nbsp;</span>Missing Values</a></span></li><li><span><a href="#Duplicated-Data" data-toc-modified-id="Duplicated-Data-2.7.3"><span class="toc-item-num">2.7.3&nbsp;&nbsp;</span>Duplicated Data</a></span></li></ul></li><li><span><a href="#Write-Data" data-toc-modified-id="Write-Data-2.8"><span class="toc-item-num">2.8&nbsp;&nbsp;</span>Write Data</a></span></li><li><span><a href="#Menggabungkan-Data" data-toc-modified-id="Menggabungkan-Data-2.9"><span class="toc-item-num">2.9&nbsp;&nbsp;</span>Menggabungkan Data</a></span><ul class="toc-item"><li><span><a href="#Concatenate" data-toc-modified-id="Concatenate-2.9.1"><span class="toc-item-num">2.9.1&nbsp;&nbsp;</span>Concatenate</a></span></li><li><span><a href="#Merge" data-toc-modified-id="Merge-2.9.2"><span class="toc-item-num">2.9.2&nbsp;&nbsp;</span>Merge</a></span><ul class="toc-item"><li><span><a href="#Merge-Method" data-toc-modified-id="Merge-Method-2.9.2.1"><span class="toc-item-num">2.9.2.1&nbsp;&nbsp;</span>Merge Method</a></span></li></ul></li><li><span><a href="#Group-By" data-toc-modified-id="Group-By-2.9.3"><span class="toc-item-num">2.9.3&nbsp;&nbsp;</span>Group By</a></span></li></ul></li></ul></li></ul></div>

# Pengantar

**Compiled by: Reza R Pratama**

## Libraries

> Merupakan sekumpulan modul, function, object, maupun method yang didistribusikan untuk dapat digunakan secara luas.

Beberapa library yang perlu diketahui:
1. [Pandas](https://pandas.pydata.org/).
2. [Matplotlib](https://matplotlib.org/).
3. [ScikitLearn](https://scikit-learn.org/stable/index.html).
4. [NLTK](https://www.nltk.org/).

### Install libraries

Cara umum untuk menginstall library pihak ketiga bisa menggunakan perintah:

```pip``` install ```nama_library```

Library baru dapat digunakan jika sudah terinstall.

### Cara memanggil library

> Untuk menggunakan sebuah library kita perlu melakukan import

```python
import math

math.pi
```

> Menggunakan alias untuk library yang kita import

```python
import numpy as np
np.sqrt(9)
```

> Melakukan import beberapa bagian saja pada library

```python
from fibo import fib, fib2
fib(500)
```

# Pandas üêº

Pandas adalah sebuah library di Python yang menyediakan struktur data dan analisis data yang mudah digunakan. Pandas biasa digunakan untuk membuat tabel, mengubah dimensi data, mengecek data, dan lain sebagainya.


![pandas.png](https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/2560px-Pandas_logo.svg.png)

## Rekomendasi bacaan

1. Video Youtube MOFDAC
2. https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf
3. https://www.enthought.com/wp-content/uploads/Enthought-Python-Pandas-Cheat-Sheets-1-8-v1.0.2.pdf

## Import Pandas

Notes:
- sebelum menggunakan pandas kita harus memastikan apakah pandas sudah terinstall di sistem kita
- jika belum terinstall kita bisa menggunakan pip install pandas pada command prompt kita
- sebelum menggunakan pandas kita harus memanggil/mengimport library pandas

In [1]:
#kita akan mengimport library pandas
#kita akan memberikan nama lain yaitu pd yang artinya kita bisa memanggil pandas dengan pd
import pandas as pd

##  Series dan DataFrame

sebelum kita berekplorasi lebih jauh dengan pandas kita perlu mengenal tipe struktur data pada pandas. pada pandas ada 2 struktur data yaitu
- **series**
- **dataframe**


berbeda dengan python yang memiliki tuple,list,dictionary, dll.

### Series

<img src="">

In [2]:
list_nama = ['Budi','Zainudin','Leonardo','Gwenn','Peter']

In [3]:
series_nama = pd.Series(list_nama)
print(series_nama)

0        Budi
1    Zainudin
2    Leonardo
3       Gwenn
4       Peter
dtype: object

* Budi, Zainudin, dll adalah value dari series_nama
* Angka 0, 1, 2, 3, 4 di sebelah kiri adalah index dari series_nama
* untuk dapat melihat index pada series kita dapat memanggil atribut .index

#### index

In [4]:
series_nama.index

RangeIndex(start=0, stop=5, step=1)

* kita juga dapat menentukan atau mengubah index sesuai yang kita inginkan
* perhatikan bahwa panjang data index harus sama dengan data seriesnya

In [5]:
# kita akan menentukan index yang ingin kita gunakan
nama_index = ['a', 'b', 'c', 'd', 'e']

series_nama = pd.Series(data=list_nama, index=nama_index)
series_nama.head()

a        Budi
b    Zainudin
c    Leonardo
d       Gwenn
e       Peter
dtype: object

In [6]:
#misal kita sudah membuat sebuat series namun kita ingin mengubah index yang ada
index_baru = ['a1','a2','a3','a4','a5']
series_nama.index = index_baru
series_nama

a1        Budi
a2    Zainudin
a3    Leonardo
a4       Gwenn
a5       Peter
dtype: object

#### Value

In [7]:
#kita bisa memanggil seluruh values dari series_nama dengan atribut .values
series_nama.values

array(['Budi', 'Zainudin', 'Leonardo', 'Gwenn', 'Peter'], dtype=object)

#### Method dan Atribut lainnya

* sebelumnya sudah diperkenalkan atribut index dan values
* masih ada beberapa method dan atribut yang terdapat pada [Pandas Series](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html)

In [8]:
#beberapa atribut pada pandas Series
# 1. melihat values dari series
print(series_nama.values)
# 2. melihat index dari series
print(series_nama.index)
# 3. melihat tipe data dari series
print(series_nama.dtypes)
# 4. melihat ukuran dari series
print(series_nama.size)

['Budi' 'Zainudin' 'Leonardo' 'Gwenn' 'Peter']
Index(['a1', 'a2', 'a3', 'a4', 'a5'], dtype='object')
object
5

In [9]:
#kita akan membuat contoh lain untuk data numerical
angka = [1,2,3,4,5,6]
series_angka = pd.Series(angka)
print(series_angka)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [10]:
#kita coba juga atribut yang telah kita pelajari
# 1. melihat values dari series
print(series_angka.values)
# 2. melihat index dari series
print(series_angka.index)
# 3. melihat tipe data dari series
print(series_angka.dtypes)
# 4. melihat ukuran dari series
print(series_angka.size)

[1 2 3 4 5 6]
RangeIndex(start=0, stop=6, step=1)
int64
6

#### Series vs List

In [11]:
#set series & list
angka = [1,2,3,4,5,6]
series_angka = pd.Series(angka)

#1. tipe Data
print(type(angka))
print(type(series_angka))

<class 'list'>
<class 'pandas.core.series.Series'>

In [12]:
#Series like a vector
print(angka*2)
print(series_angka*2)

[1, 2, 3, 4, 5, 6, 1, 2, 3, 4, 5, 6]
0     2
1     4
2     6
3     8
4    10
5    12
dtype: int64

beberapa method pada pandas Series

1. Deskripsi dari data

In [13]:
#jika data kategorikal maka dia akan menunjukan data sebnagai berikut
series_nama.describe()

count        5
unique       5
top       Budi
freq         1
dtype: object

In [14]:
#jika data numerikal maka dia akan menunjukan data sebnagai berikut
series_angka.describe()

count    6.000000
mean     3.500000
std      1.870829
min      1.000000
25%      2.250000
50%      3.500000
75%      4.750000
max      6.000000
dtype: float64

In [15]:
# Nilai unik dari series_nama
print(f"Nilai unik = {series_nama.unique()}")

# Banyak nilai unik dari series_nama
print(f"Nilai unik = \n{series_nama.value_counts()}")

Nilai unik = ['Budi' 'Zainudin' 'Leonardo' 'Gwenn' 'Peter']
Nilai unik =
Budi        1
Zainudin    1
Leonardo    1
Gwenn       1
Peter       1
dtype: int64

In [16]:
#selain itu kita bisa menggunkan beberapa method lain 
print(f'Nilai Total : {series_angka.sum()}')
print (f'Angka tertinggi : {series_angka.max()}')
print (f'Angka tertinggi : {series_angka.min()}')
print (f'Mean : {series_angka.mean()}')
print (f'Median : {series_angka.median()}')

Nilai Total : 21
Angka tertinggi : 6
Angka tertinggi : 1
Mean : 3.5
Median : 3.5

#### Operasi Dasar

In [17]:
#kita akan gunakan series yang sudah ada yaitu series_nama
series_nama

a1        Budi
a2    Zainudin
a3    Leonardo
a4       Gwenn
a5       Peter
dtype: object

In [18]:
#ketika kita ingin memanggil suatu values kita dapat gunakan indexnya
series_nama['a1']

'Budi'

In [19]:
#jika kita ingin menambahkan data pada series maka kita dapat lakukan
series_nama['a6'] = 'Suci'
series_nama

a1        Budi
a2    Zainudin
a3    Leonardo
a4       Gwenn
a5       Peter
a6        Suci
dtype: object

In [20]:
#untuk merubah value dari suatu index kita dapat lakukan
series_nama['a5'] = 'Susanto'
series_nama

a1        Budi
a2    Zainudin
a3    Leonardo
a4       Gwenn
a5     Susanto
a6        Suci
dtype: object

In [21]:
#untuk menghapus salah satu value maka kita dapat lakukan
del series_nama['a3']
series_nama

a1        Budi
a2    Zainudin
a4       Gwenn
a5     Susanto
a6        Suci
dtype: object

---

Latihan
1. Buat sebuah series dengan data berikut
| index | Values (populasi) |
| :-: | :-- |
|Jakarta| 10.6|
|Bandung|1.4|
|Medan|2.1|

2. tambahkan data Surabaya dengan populasi 2.8
3. ternyata data Bandung salah seharusnya 2.4
4. cari rata2 penduduk pada wilayah di series

In [22]:
# isikan jawabannya disini

### Dataframe

* DataFrame dari Pandas adalah struktur data 2-dimensi yang berbentuk tabular (memiliki baris dan kolom)
* DataFrame adalah kumpulan Series

<img src="https://petruknisme.com/wp-content/uploads/2019/04/series-and-dataframe.width-1200.png">

In [23]:
data = {'COUNTRY':['China','India','US','Indonesia','Brazil'],
        'GDP':[12_234.78,2_575.67,19_485.39,1_015.54,2_055.51],
        'POP':[1_398.72,1_351.16,329.74,268.07,210.32]}

columns = ('COUNTRY', 'POP', 'AREA', 'GDP', 'CONT', 'IND_DAY')

In [24]:
df = pd.DataFrame(data=data)
df

     COUNTRY       GDP      POP
0      China  12234.78  1398.72
1      India   2575.67  1351.16
2         US  19485.39   329.74
3  Indonesia   1015.54   268.07
4     Brazil   2055.51   210.32

* kolom paling kiri merupakan indeks
* bagian atas adalah nama kolom

##  Read Data

In [ ]:
#read data dari GoogleDrive di Google Colab
#from google.colab import drive
#drive.mount("/content/gdrive")'

### CSV

 suatu format data dalam basis data di mana setiap record dipisahkan dengan tanda koma (, ) atau titik koma.
 
 <img src="https://www.wikihow.com/images_en/thumb/1/17/Create-a-CSV-File-Step-9.jpg/v4-460px-Create-a-CSV-File-Step-9.jpg" width=300>

#### Import Sederhana

> Untuk membaca file csv gunakan perintah **pd.read_csv("lokasi file")**

In [25]:
df_airtravel = pd.read_csv("dataset/airtravel.csv")

In [26]:
df_airtravel

   Month   1958  1959  1960
0    JAN    340   360   417
1    FEB    318   342   391
2    MAR    362   406   419
3    APR    348   396   461
4    MAY    363   420   472
5    JUN    435   472   535
6    JUL    491   548   622
7    AUG    505   559   606
8    SEP    404   463   508
9    OCT    359   407   461
10   NOV    310   362   390
11   DEC    337   405   432

#### Import dengan arguments

> contoh sebelumnya hanya membaca data secara langsung, bagaimana jika kita hanya ingin mengambil bbrp kolom saja?

In [27]:
df_airtravel_ = pd.read_csv("dataset/airtravel.csv", usecols = ["Month","1960"])
df_airtravel_

   Month  1960
0    JAN   417
1    FEB   391
2    MAR   419
3    APR   461
4    MAY   472
5    JUN   535
6    JUL   622
7    AUG   606
8    SEP   508
9    OCT   461
10   NOV   390
11   DEC   432

> walaupun normalnya CSV dipisahkan menggunakan comma tapi terkadang kita dapat menemukan data yang dipisahkan oleh tanda lain seperti ;:|/

In [28]:
#pada file airtravel_2.csv digunakan tanda pemisah ;
#jika kita langsung membuakanya maka hasilnya akan seperti
df_airtravel2 = pd.read_csv("dataset/airtravel_2.csv")
df_airtravel2

   Month;1958;1959;1960
0       JAN;340;360;417
1       FEB;318;342;391
2       MAR;362;406;419
3       APR;348;396;461
4       MAY;363;420;472
5       JUN;435;472;535
6       JUL;491;548;622
7       AUG;505;559;606
8       SEP;404;463;508
9       OCT;359;407;461
10      NOV;310;362;390
11      DEC;337;405;432

In [29]:
df_airtravel2 = pd.read_csv("dataset/airtravel_2.csv", sep=';')
df_airtravel2

   Month  1958  1959  1960
0    JAN   340   360   417
1    FEB   318   342   391
2    MAR   362   406   419
3    APR   348   396   461
4    MAY   363   420   472
5    JUN   435   472   535
6    JUL   491   548   622
7    AUG   505   559   606
8    SEP   404   463   508
9    OCT   359   407   461
10   NOV   310   362   390
11   DEC   337   405   432

> list argumen lebih lanjut dapat dilihat di https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html#pandas.read_csv

### Excel

> terkadang kita juga menemukan data yang berextensi .xls atau .xlsx maka kita bisa membukanya dengan pd.read_excel

In [30]:
df_airtravel_3 = pd.read_excel('dataset/airtravel_3.xlsx')
df_airtravel_3.head()

  Month  1958  1959  1960
0   JAN   340   360   417
1   FEB   318   342   391
2   MAR   362   406   419
3   APR   348   396   461
4   MAY   363   420   472

### JSON

* JSON adalah singkatan dari JavaScript Object Notation.
* JSON adalah turunan JavaScript yang digunakan dalam transfer dan penyimpanan data.
* JSON sering kita temukan di internet

<img src="https://idcloudhost.com/wp-content/uploads/2021/03/Screenshot-2021-03-30-151455.jpg" width=500>

In [31]:
url = "https://api.exchangerate-api.com/v4/latest/USD"
df = pd.read_json(url)
df

,provider,WARNING_UPGRADE_TO_V6,terms,base,date,time_last_updated,rates
AED,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2022-06-15,1655251201,3.67
AFN,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2022-06-15,1655251201,89.04
ALL,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2022-06-15,1655251201,114.95
AMD,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2022-06-15,1655251201,422.06
ANG,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2022-06-15,1655251201,1.79
...,...,...,...,...,...,...,...
XPF,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2022-06-15,1655251201,114.44
YER,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2022-06-15,1655251201,249.87
ZAR,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2022-06-15,1655251201,16.05
ZMW,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2022-06-15,1655251201,16.97
ZWL,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2022-06-15,1655251201,332.56

### SQL
Import data dari SQL

In [32]:
#install dependensi
#!pip install mysql
#!pip install sqlalchemy

In [33]:
#membuat koneksi ke database
import sqlalchemy
engine = sqlalchemy.create_engine("mysql://root@localhost:3306/titanic")

In [34]:
#melakukan query dengan pandas
df_sql = pd.read_sql("SELECT * FROM titanic_table", engine)
df_sql.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,,S

----

In [35]:
# 1. dari folder latihan baca file Boston_Housing.xlsx dan tampilkan isinya
# ....isi jawaban disini....

### Summarizing Data

> list argumen lebih lanjut dapat dilihat di https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html#pandas.read_excel

Untuk melihat secara sekilas DataFrame yang kita buat, dapat menggunakan function berikut:

| Function | Penjelas |
| :-: | :-- |
| head() dan tail()| Mengakses baris awal dan akhir DataFrame |
| sample()| Memilih data secara acak |
| nlargest(n, value)| Memilih beberapa data teratas yang sudah diurutkan | 
| nsmallest(n, value)| Memilih beberapa data terbawah yang sudah diurutkan |

Selain melihat secara sekilas, kita juga bisa mengetahui informasi terkait DataFrame dengan function berikut:

| Function | Penjelas |
| :-: | :-- |
| dataframe.columns| Daftar kolom pada DataFrame |
| dataframe.info()| Informasi DataFrame, kolom tipe data dsb |
| dataframe.shape| Dimensi DataFrame | 
| dataframe.size()| Jumlah data pada DataFrame |
| dataframe.describe()| menampilkan statistik deskriptif |

In [36]:
#contoh kali ini kita akan membaca file titanic.csv
df_titanic = pd.read_csv('dataset/titanic.csv')

In [37]:
#kita akan melihat isi 3 file pertama
df_titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [38]:
#kita akan melihat isi 3 file terakhir
df_titanic.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [39]:
#kita juga bisa menampilkan dataframe dalam format horizontal dengan menggunakan method transpose atau T
df_titanic.head(3).T

,0,1,2
PassengerId,1,2,3
Survived,0,1,1
Pclass,3,1,3
Name,"Braund, Mr. Owen Harris","Cumings, Mrs. John Bradley (Florence Briggs Th...","Heikkinen, Miss. Laina"
Sex,male,female,female
Age,22.0,38.0,26.0
SibSp,1,1,0
Parch,0,0,0
Ticket,A/5 21171,PC 17599,STON/O2. 3101282
Fare,7.25,71.2833,7.925
Cabin,NaN,C85,NaN
Embarked,S,C,S

In [40]:
# kita akan mencoba baris secara acak dari dataset
df_titanic.sample(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
426,427,1,2,"Clarke, Mrs. Charles V (Ada Maria Winfield)",female,28.0,1,0,2003,26.000,NaN,S
126,127,0,3,"McMahon, Mr. Martin",male,NaN,0,0,370372,7.750,NaN,Q
239,240,0,2,"Hunt, Mr. George Henry",male,33.0,0,0,SCO/W 1585,12.275,NaN,S

In [41]:
#kita ingin menampilkan 3 umur tertua
df_titanic.nlargest(3,"Age")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C

In [42]:
#kita ingin mengetahui kolom apa saja yang ada pada data titanic
df_titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [43]:
# kita ingin menampilkan info umum (count dan Dtype) dataset
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [44]:
# kita akan mencoba melakukan print ukuran dari dataset
# baris dan kolom
df_titanic.shape
#terdapat 891 baris dengan 12 kolom

(891, 12)

In [45]:
# kita akan mencoba melakukan print atasjumlah baris di dataset
df_titanic.size

10692

In [46]:
# menghitung count atas satu kolom
df_titanic.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [47]:
# menghitung panjang maksimal dari suatu kolom di dataset
len(df_titanic)

891

In [48]:
# deskripsi untuk data kuantitatif
# menggunakan .describe()
df_titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [49]:
# deskripsi untuk data kualitatif
df_titanic.describe(include=['O'])

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [50]:
# kita ingin melihat bearapa banyak data yang kosong
df_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [51]:
# kita juga bisa melihat sebaran atas unique value dari suatu kolom
df_titanic['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [52]:
# mengetahui jumlah data unique dari suatu fitur dengan .nunique()
df_titanic['Pclass'].nunique()

3

## Data Selection

### Mengambil seluruh baris dari sebagian kolom (row slicing)

In [53]:
#kita bisa menuliskan nama kolom menggunakan df['nama_kolom']
df_titanic['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [54]:
#cara lainnya
df_titanic.Name

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [55]:
#mengambil lebih dari 1 kolom
df_titanic[['Name','Sex','Survived']]

                                                  Name     Sex  Survived
0                              Braund, Mr. Owen Harris    male         0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female         1
2                               Heikkinen, Miss. Laina  female         1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female         1
4                             Allen, Mr. William Henry    male         0
..                                                 ...     ...       ...
886                              Montvila, Rev. Juozas    male         0
887                       Graham, Miss. Margaret Edith  female         1
888           Johnston, Miss. Catherine Helen "Carrie"  female         0
889                              Behr, Mr. Karl Howell    male         1
890                                Dooley, Mr. Patrick    male         0

[891 rows x 3 columns]

### Mengambil seluruh kolom dari sebagian baris (columns slicing)

In [56]:
#mengakses baris menggunakan loc
df_titanic.loc[5]

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                         NaN
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

In [57]:
df_titanic[:4]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [58]:
df_titanic[3:7]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [59]:
df_titanic[-4:]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

### Mengambil sebagian baris pada sebagian kolom (row-column slicing)

In [60]:
df_titanic[['Name','Sex','Survived']][:5]

                                                Name     Sex  Survived
0                            Braund, Mr. Owen Harris    male         0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female         1
2                             Heikkinen, Miss. Laina  female         1
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female         1
4                           Allen, Mr. William Henry    male         0

### Loc dan Iloc

#### .loc

> Memilih baris atau kolom dengan label tertentu dari index.

```python
dataframe1.loc["kolom1", "kolom2"]

dataframe1.loc["kolom1":"value1", "kolom2":"value2"]
```

In [61]:
# kita akan coba mengakses sampai dengan index ke 4 (baris ke-5) 
# mulai dari Kolom 'Pclass' s.d. kolom 'Age'
df_titanic.loc[:4, 'Pclass':'Age']

   Pclass                                               Name     Sex   Age
0       3                            Braund, Mr. Owen Harris    male  22.0
1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2       3                             Heikkinen, Miss. Laina  female  26.0
3       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4       3                           Allen, Mr. William Henry    male  35.0

In [62]:
# kita akan coba mengakses sampai dengan index ke 4 (baris ke-5)
# atas keseluruhan dataset
df_titanic.loc[:4]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [63]:
# kita akan coba mengakses sampai dengan index ke 4 (baris ke-5) 
# hanya pada kolom Age
df_titanic.loc[:4,'Age']

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

#### .iloc

> Memilih baris atau kolom dengan label tertentu dari posisi index (integers).

```python
dataframe1.iloc[baris, kolom]

dataframe1.iloc[start:end (baris), start:end(kolom)]
```

In [64]:
# kita akan coba mengakses dari index ke-5 s.d. index ke-9 
# dari kolom 1 s.d. 5
df_titanic.iloc[5:10, 0:5]

,PassengerId,Survived,Pclass,Name,Sex
5,6,0,3,"Moran, Mr. James",male
6,7,0,1,"McCarthy, Mr. Timothy J",male
7,8,0,3,"Palsson, Master. Gosta Leonard",male
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female

In [65]:
# kita akan coba mengakses dari index ke-3 s.d. index ke-6
# atas kolom 1,4,3,2
df_titanic.iloc[3:7, [0,3,2,1]]

   PassengerId                                          Name  Pclass  Survived
3            4  Futrelle, Mrs. Jacques Heath (Lily May Peel)       1         1
4            5                      Allen, Mr. William Henry       3         0
5            6                              Moran, Mr. James       3         0
6            7                       McCarthy, Mr. Timothy J       1         0

### Filtering data

Cara pertama untuk melakukan filter adalah menggunakan ```conditional```.

```python
dataframe1[conditional]

```

Yang kedua menggunakan ```query```.

```python
df.query('20 < Age < 40')[:5]

```

#### Conditional

In [66]:
# mengambil Data dengan Kondisi
# membuat variabel penampung agar memudahkan
age = df_titanic.Age >= 22
pclass_3 = df_titanic.Pclass == 3
male = df_titanic.Sex == "male"
# filter untuk penumpang berumur diatas 22
df_titanic[(age)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [67]:
# filter untuk penumpang berjenis kelamin Male dan berumur diatas 22
df_titanic[age & male]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [68]:
# filter untuk penumpang berada di class 3 dan berumur diatas 22
df_titanic[pclass_3 & age]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [69]:
# filter penumpang dengan Embarked Q atau penumpang dengan Embarked S
df_titanic[(df_titanic.Embarked == "Q") | (df_titanic.Embarked == "S")]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

#### Query

In [70]:
# kita akan mencoba mengambil Kolom Age 
# dimana nilai "Age" berada di antara 20 s.d. 40 tahun (5 baris pertama)
df_titanic.query('20 < Age < 40')[:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

---
**Latihan**

1. Ambil data dari titanic.csv dengan kriteria penumpang ```diatas 40 tahun``` dan berjenis kelamin ```Perempuan```.
2. Perlihatkan data penumpang dengan ```kelas "1"``` yang berhasil selamat ```(Survived = 1)```.

In [71]:
#isi jawabanmu disini

## Sorting Data

> Mengurutkan data berdasarkan valuenya.

Untuk melakukan sorting data pada DataFrame:
1. Hanya satu kolom:
```python
DataFrame.sort_values(by='', ascending=False)
```
2. Beberapa kolom:
```python
DataFrame.sort_values(["b", "c"], ascending = (False, True))
```

In [72]:
# kita akan mencoba melakukan sorting pada kolom 'Age' secara 'Menurun'
df_titanic.sort_values('Age', ascending = False)[:4]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C

In [73]:
# untuk dua atau lebih kolom
df_titanic.sort_values(['Age','Pclass', 'Fare'], ascending = (True,False,True))[:4]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C

## Data Manipulation

### Drop Row or Columns

In [74]:
#agar data awal kita tidak rusak maka kita lakukan dengan mencopy df_titanic
df_titanic_copy = df_titanic.copy()

In [75]:
df_titanic_copy.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

#### Menghapus Kolom

In [76]:
#kita akan mencoba menghapus kolom ticket dan kita simpan pada variabel yang sama
df_titanic_copy = df_titanic_copy.drop('Ticket', axis = 1)
df_titanic_copy.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,NaN,S

In [77]:
#bagaimana jika kita ingin menghapus 2 kolom
# kita dapat menambahkan kolom dengan diberi tanda kurung siku []
df_titanic_copy.drop(['Fare','Cabin'], axis = 1, inplace=True)
df_titanic_copy.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,S

#### Menghapus Baris

In [78]:
#menghapus row dengan index 2
df_titanic_copy.drop(index = 2, inplace=True)
df_titanic_copy.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,Q

In [79]:
#menghapus row dengan index 1 dan 4
df_titanic_copy.drop(index =[1,4] , inplace=True)
df_titanic_copy.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,S

In [80]:
#jika kita ingin melakukan reset index maka kita bisa gunakan reset_index 
df_titanic_copy.reset_index(drop=True, inplace=True)
df_titanic_copy.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,S
1,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,S
2,6,0,3,"Moran, Mr. James",male,NaN,0,0,Q
3,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,S
4,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,S

In [81]:
#jika kita ingin menghapus baris berdasarkan isinya
#misal kita ingin menghapus yang berumur 22 tahun
#1. kita bisa menggunakna Filtering
df_titanic_copy = df_titanic_copy[df_titanic_copy.Age != 22]

### Missing Values

In [82]:
#kita copy dlu data df_titanic agar aman
df_titanic_missing = df_titanic.copy()

In [83]:
#untuk melakukan pengecekan apakah ada missing Value dalam dataset kita maka kita dapat menggunakan (isna/isnull)
df_titanic_missing.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### Duplicated Data

# mengecek duplikasi row data
df_titanic.duplicated().sum()
#jika ada data duplicated kita bisa hapus dengan drop_duplicates

In [84]:
# mengecek duplikasi tiap kolom
df_titanic.Ticket.duplicated().sum()

210

##  Write Data

Untuk menyimpan dataframe dapat menggunakan beberapa fungsi berikut:

```python
dataframe.to_csv()
dataframe.to_excel()
```

In [85]:
#CSV
df_titanic.to_csv('titanic_2.csv')
#Excel
df_titanic.to_excel('titanic_2.xlsx',sheet_name='Sheet1',index=False)

##  Menggabungkan Data

> dalam mengolah data terkadang kita butuh menggabungkan data baik secara horizontal (merge) maupun vertikal (Concatenation)

### Concatenate
<img src="https://static.javatpoint.com/tutorial/numpy/images/numpy-concatenate.png">

In [86]:
#kita coba membuat 2 buah series
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

> diatas tadi sengaja dibuat seriesnya berurut kalo sama bagaimana?

In [87]:
#kita coba membuat 2 buah series
ser1 = pd.Series(['A', 'B', 'C'])
ser2 = pd.Series(['D', 'E', 'F'])
pd.concat([ser1, ser2])

0    A
1    B
2    C
0    D
1    E
2    F
dtype: object

In [88]:
#ketika indexnya sama maka indexnya akan berulang
#untuk mengatasinya kita bisa menambahkan ignore_index=True
pd.concat([ser1, ser2], ignore_index=True)

0    A
1    B
2    C
3    D
4    E
5    F
dtype: object

In [89]:
#kita buat 2 dataframe yang berisi nama mahasiswa dan jurusannya
df1 = pd.DataFrame({'Nama': ['Anton', 'Budi', 'Bambang'],
                    'Jurusan': ['Akuntansi', 'Tambang', 'Bisnis']})
df2 = pd.DataFrame({'Nama': ['Susilo', 'Sulastri', 'Jane', 'Samsul'],
                    'Jurusan': ['Pertanian', 'Akuntansi', 'Managemen', 'Seni Rupa']})
print(df1)
print(df2)

      Nama    Jurusan
0    Anton  Akuntansi
1     Budi    Tambang
2  Bambang     Bisnis
       Nama    Jurusan
0    Susilo  Pertanian
1  Sulastri  Akuntansi
2      Jane  Managemen
3    Samsul  Seni Rupa

In [90]:
pd.concat([df1, df2], ignore_index=True)

       Nama    Jurusan
0     Anton  Akuntansi
1      Budi    Tambang
2   Bambang     Bisnis
3    Susilo  Pertanian
4  Sulastri  Akuntansi
5      Jane  Managemen
6    Samsul  Seni Rupa

In [91]:
appended = df1.append(df2, ignore_index=True)
appended

C:\Users\reza.pratama\AppData\Local\Temp\ipykernel_21616\1304998113.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  appended = df1.append(df2, ignore_index=True)

       Nama    Jurusan
0     Anton  Akuntansi
1      Budi    Tambang
2   Bambang     Bisnis
3    Susilo  Pertanian
4  Sulastri  Akuntansi
5      Jane  Managemen
6    Samsul  Seni Rupa

> bagaimana kalo ada kolom yang di tabel berikutnya tidak ada. apakah masih bisa kita gabung?

In [92]:
#kita buat 2 dataframe
df3 = pd.DataFrame({'Nama': ['Anton', 'Budi', 'Bambang'],
                    'Jurusan': ['Akuntansi', 'Tambang', 'Bisnis'],
                    'Tahun': [2020,2019,2021]})
df4 = pd.DataFrame({'Nama': ['Susilo', 'Sulastri', 'Jane', 'Samsul'],
                    'Jurusan': ['Pertanian', 'Akuntansi', 'Managemen', 'Seni Rupa'],
                    'Tahun_lahir': [2002,2001,2000,2001]})
print(df3)
print(df4)

      Nama    Jurusan  Tahun
0    Anton  Akuntansi   2020
1     Budi    Tambang   2019
2  Bambang     Bisnis   2021
       Nama    Jurusan  Tahun_lahir
0    Susilo  Pertanian         2002
1  Sulastri  Akuntansi         2001
2      Jane  Managemen         2000
3    Samsul  Seni Rupa         2001

In [93]:
#mari kita gabungkan
concatenated = pd.concat([df3,df4], ignore_index=True)
concatenated

       Nama    Jurusan   Tahun  Tahun_lahir
0     Anton  Akuntansi  2020.0          NaN
1      Budi    Tambang  2019.0          NaN
2   Bambang     Bisnis  2021.0          NaN
3    Susilo  Pertanian     NaN       2002.0
4  Sulastri  Akuntansi     NaN       2001.0
5      Jane  Managemen     NaN       2000.0
6    Samsul  Seni Rupa     NaN       2001.0

> terlihat bahwa diatas ada row yang isinya NaN, bagaimana kalo kita ingin menghapusnya?

In [94]:
#kita bisa menambahkan join='inner'
concatenated = pd.concat([df3,df4], ignore_index=True, join='inner')
concatenated

       Nama    Jurusan
0     Anton  Akuntansi
1      Budi    Tambang
2   Bambang     Bisnis
3    Susilo  Pertanian
4  Sulastri  Akuntansi
5      Jane  Managemen
6    Samsul  Seni Rupa

### Merge
<details>
<img src="https://www.absentdata.com/wp-content/uploads/2019/07/pd.merge-1.png">
</details>

In [95]:
#kita buat 2 dataframe 
df1 = pd.DataFrame({"id": ['001','002','003'],
                    'Nama': ['Anton', 'Budi', 'Bambang'],
                    'Tahun_masuk': [2020,2019,2021]})
df2 = pd.DataFrame({"id": ['001','002','003'],
                    'Jurusan': ['Akuntansi', 'Tambang', 'Bisnis']})
print(df1)
print(df2)

    id     Nama  Tahun_masuk
0  001    Anton         2020
1  002     Budi         2019
2  003  Bambang         2021
    id    Jurusan
0  001  Akuntansi
1  002    Tambang
2  003     Bisnis

In [96]:
#kita akan menggabungkan kedua dataframe tersebut dengan menggunakan method .merge
df3 = pd.merge(df1, df2)
df3

    id     Nama  Tahun_masuk    Jurusan
0  001    Anton         2020  Akuntansi
1  002     Budi         2019    Tambang
2  003  Bambang         2021     Bisnis

* Fungsi `pd.merge()` mengenali bahwa terdapat kolom id yang sama di kedua dataframe sehingga langsung tergabung
* sekarang bagaimana kalo nama kolomnya beda

In [97]:
#kita buat 2 dataframe 
df1 = pd.DataFrame({"id": ['001','002','003'],
                    'Nama': ['Anton', 'Budi', 'Bambang'],
                    'Tahun_masuk': [2020,2019,2021]})
df2 = pd.DataFrame({"no_mahasiswa": ['001','002','003'],
                    'Jurusan': ['Akuntansi', 'Tambang', 'Bisnis']})
print(df1)
print(df2)

    id     Nama  Tahun_masuk
0  001    Anton         2020
1  002     Budi         2019
2  003  Bambang         2021
  no_mahasiswa    Jurusan
0          001  Akuntansi
1          002    Tambang
2          003     Bisnis

In [98]:
#kita akan menggabungkan kedua dataframe yang mempunyai nama kolom key yang bebeda
df3 = pd.merge(df1, df2, left_on="id", right_on="no_mahasiswa")
df3

    id     Nama  Tahun_masuk no_mahasiswa    Jurusan
0  001    Anton         2020          001  Akuntansi
1  002     Budi         2019          002    Tambang
2  003  Bambang         2021          003     Bisnis

> nb: kalo dia ada 2 key maka bisa ditambahkan ,on=[key1,key2]

#### Merge Method
ada 4 method
- inner
- left
- right
- outer

<img src="https://storage.googleapis.com/kotakode-prod-public/images/b41cac0f-e745-4696-a890-d5f709cc6d7f-join.jpg">

In [99]:
#kita buat 2 dataframe 
df1 = pd.DataFrame({"id": ['001','002','003','004'],
                    'Nama': ['Anton', 'Budi', 'Bambang','leon'],
                    'Tahun_masuk': [2020,2019,2021,2018]})
df2 = pd.DataFrame({"id": ['001','002','003','005'],
                    'Jurusan': ['Akuntansi', 'Tambang', 'Bisnis','Managemen']})
print(df1)
print(df2)

    id     Nama  Tahun_masuk
0  001    Anton         2020
1  002     Budi         2019
2  003  Bambang         2021
3  004     leon         2018
    id    Jurusan
0  001  Akuntansi
1  002    Tambang
2  003     Bisnis
3  005  Managemen

In [100]:
#terlihat pada dataframe bahwa ada masing-masing 1 yang tidak memiliki pasangan
#secara default dia pakai inner, data yang tersambung yang akan ditampilkan
hoo = pd.merge(df1,df2)
hoo

    id     Nama  Tahun_masuk    Jurusan
0  001    Anton         2020  Akuntansi
1  002     Budi         2019    Tambang
2  003  Bambang         2021     Bisnis

In [101]:
#jika kita ingin menampilkan semuanya maka gunakan outer
hoo = pd.merge(df1,df2, how='outer')
hoo

    id     Nama  Tahun_masuk    Jurusan
0  001    Anton       2020.0  Akuntansi
1  002     Budi       2019.0    Tambang
2  003  Bambang       2021.0     Bisnis
3  004     leon       2018.0        NaN
4  005      NaN          NaN  Managemen

In [102]:
#jika kita ingin menampilkan data sebelah kiri full
hoo = pd.merge(df1,df2, how='left')
hoo

    id     Nama  Tahun_masuk    Jurusan
0  001    Anton         2020  Akuntansi
1  002     Budi         2019    Tambang
2  003  Bambang         2021     Bisnis
3  004     leon         2018        NaN

In [103]:
#jika kita ingin menampilkan data sebelah kanan full
hoo = pd.merge(df1,df2, how='right')
hoo

    id     Nama  Tahun_masuk    Jurusan
0  001    Anton       2020.0  Akuntansi
1  002     Budi       2019.0    Tambang
2  003  Bambang       2021.0     Bisnis
3  005      NaN          NaN  Managemen

### Group By

> terkadang kita membutuhkan data yang sudah di grouping. cara yang ditawarkan pandas adalah dengan method .groupby

In [104]:
# mari kita buka data populasi amerika
df_amerika = pd.read_csv('dataset/america_population.csv')
df_amerika

     rank           name usps  pop2022  pop2010  growth  density  aland_sqmi
0       1  New York City   NY  8177025  8190209 -0.0016    27222     300.381
1       2    Los Angeles   CA  3985516  3795512  0.0501     8499     468.956
2       3        Chicago   IL  2671635  2697477 -0.0096    11750     227.369
3       4        Houston   TX  2325353  2100280  0.1072     3632     640.194
4       5        Phoenix   AZ  1759943  1449038  0.2146     3400     517.673
..    ...            ...  ...      ...      ...     ...      ...         ...
195   196           Waco   TX   143286   125377  0.1428     1613      88.856
196   197     Bridgeport   CT   143280   144864 -0.0109     8919      16.064
197   198        Miramar   FL   143072   122300  0.1698     4959      28.853
198   199         Olathe   KS   142906   126269  0.1318     2318      61.642
199   200       Metairie   LA   142135   138481  0.0264     6111      23.259

[200 rows x 8 columns]

In [105]:
#kita akan melakukan grouping terhadap jumlah populasi berdasarkan state
#kita cek terlebih dahulu ada berapa state
df_amerika.usps.nunique()

43

In [106]:
#kita akan grouping dengan method .groupby
state_population = df_amerika.groupby(['usps'])
state_population

> terlihat bahwa hasil dari groupby tidak menghasilkan dataframe tapi DataFrameGroupBy, untuk mengeluarkan datanya kita perlu method seperti, .count(), .sum(), .mean(), atau [lainnya](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html)

In [107]:
state_population.sum()

      rank   pop2022   pop2010  growth  density  aland_sqmi
usps
AK      76    280437    293321 -0.0439      164    1706.800
AL     511    796928    793439  0.0333     4946     659.786
AR     132    196796    193972  0.0146     1640     119.992
AZ     837   4482730   3741824  2.1209    31166    1596.979
CA    4155  16002144  14869641  3.3407   220517    2925.911
CO     620   2134166   1757517  1.2256    20999     638.684
CT     197    143280    144864 -0.0109     8919      16.064
DC      20    718355    605226  0.1869    11750      61.136
FL    1376   3911142   3356685  2.2194    63105    1540.489
GA     464   1087668    972700  0.2988     6131     903.888
HI      57    339421    339121  0.0009     5606      60.544
IA     115    208966    205032  0.0192     2370      88.180
ID     101    230510    209576  0.0999     2755      83.674
IL     714   3304293   3338757 -0.0557    24409     439.720
IN      93   1171884   1075740  0.1851     4993     472.207
KS     549    891714    828932  0.3755     8679     423.299
KY      90    940397    893330  0.1271     3482     547.071
LA     515    924441    917064 -0.0292    12558     386.503
MA     347   1033443    956376  0.1264    24123     117.568
MD      31    566631    620915 -0.0874     7000      80.947
MI     150    864837    899138  0.0130     9317     183.471
MN     110    755219    668577  0.2493    14210     105.978
MO     273    966230    939409  0.0711     8385     459.022
MS     183    151196    173698 -0.1295     1361     111.086
NC     549   2652772   2220567  1.2631    17680    1033.599
NE     111    776489    719114  0.1855     6483     237.206
NJ     358    683685    671890  0.0389    46261      47.301
NM      32    563165    546755  0.0300     3008     187.215
NV     753   2378712   1983931  1.7977    33774     619.098
NY     336   8837417   8858108 -0.0285    50437     394.537
OH     352   2068188   1969995  0.0676    19480     517.149
OK      72   1080010    974919  0.1896     3159     803.923
OR     332   1024360    897203  0.4344    12724     226.250
PA      75   1884914   1833566  0.0182    17214     189.655
PR     229    484313    567927 -0.2878    14146      66.511
RI     150    180972    178029  0.0165     9832      18.406
SD     137    193978    154533  0.2553     2480      78.229
TN     665   2033740   1848805  0.9847    10991    1195.081
TX    2701  12199457  10461078  5.4331    76597    4017.308
UT     125    200963    186643  0.0767     1815     110.698
VA     745   1752206   1638960  0.5562    33356     806.354
WA     545   1581953   1314337  0.8235    25635     284.585
WI     117    851661    828595  0.1204     9440     175.523

In [108]:
#jika kita hanya ingin melihat data pada state tertentu maka kita bisa gunakan method get_group
Texas_population = df_amerika.groupby(['usps']).get_group('TX')
Texas_population

     rank            name usps  pop2022  pop2010  growth  density  aland_sqmi
3       4         Houston   TX  2325353  2100280  0.1072     3632     640.194
5       6     San Antonio   TX  1598964  1332299  0.2002     3296     485.113
8       9          Dallas   TX  1348886  1200350  0.1237     3970     339.736
9      10          Austin   TX  1028225   806164  0.2755     3214     319.939
11     12      Fort Worth   TX   958692   748441  0.2809     2774     345.584
21     22         El Paso   TX   687287   650671  0.0563     2670     257.420
48     49       Arlington   TX   401047   365892  0.0961     4187      95.779
59     60  Corpus Christi   TX   327423   305272  0.0726     2050     159.703
73     74           Plano   TX   284467   261234  0.0889     3968      71.682
82     83          Laredo   TX   267396   236807  0.1292     2529     105.743
85     86         Lubbock   TX   266041   231105  0.1512     1975     134.723
94     95          Frisco   TX   236604   118201  1.0017     3473      68.125
96     97          Irving   TX   234920   216859  0.0833     3503      67.060
97     98         Garland   TX   234585   227345  0.0318     4111      57.060
106   107        McKinney   TX   221464   132934  0.6660     3308      66.940
127   128        Amarillo   TX   199935   191249  0.0454     1965     101.744
134   135   Grand Prairie   TX   196205   175974  0.1150     2715      72.255
145   146     Brownsville   TX   184125   175362  0.0500     1391     132.322
167   168         Killeen   TX   160615   129024  0.2448     2945      54.545
169   170         Midland   TX   157633   111276  0.4166     2119      74.383
181   182          Denton   TX   151219   117010  0.2924     1571      96.236
188   189      Round Rock   TX   146941   100772  0.4582     4058      36.213
189   190        Pasadena   TX   146709   149523 -0.0188     3366      43.586
191   192      Carrollton   TX   145953   119564  0.2207     3980      36.669
192   193         McAllen   TX   145482   132093  0.1014     2214      65.698
195   196            Waco   TX   143286   125377  0.1428     1613      88.856

In [109]:
#jika kita hanya ingin melihat kolom tertentu saja maka kita bisa tambahkan syntax .groupby(['Nama Kolom grouping'])['Nama kolom target 1', 'Nama kolom target 2', ...]
#disini kita ingin melihat populasi pada tahun 2022 per State
population_2022 = df_amerika.groupby(['usps'])['pop2022']
population_2022.sum()

usps
AK      280437
AL      796928
AR      196796
AZ     4482730
CA    16002144
CO     2134166
CT      143280
DC      718355
FL     3911142
GA     1087668
HI      339421
IA      208966
ID      230510
IL     3304293
IN     1171884
KS      891714
KY      940397
LA      924441
MA     1033443
MD      566631
MI      864837
MN      755219
MO      966230
MS      151196
NC     2652772
NE      776489
NJ      683685
NM      563165
NV     2378712
NY     8837417
OH     2068188
OK     1080010
OR     1024360
PA     1884914
PR      484313
RI      180972
SD      193978
TN     2033740
TX    12199457
UT      200963
VA     1752206
WA     1581953
WI      851661
Name: pop2022, dtype: int64

In [110]:
#selain cara diatas kita juga bisa menggunakan pivot table
df_amerika.pivot_table('pop2022', index='usps')

           pop2022
usps
AK    2.804370e+05
AL    1.992320e+05
AR    1.967960e+05
AZ    4.482730e+05
CA    4.103114e+05
CO    3.556943e+05
CT    1.432800e+05
DC    7.183550e+05
FL    3.008571e+05
GA    2.719170e+05
HI    3.394210e+05
IA    2.089660e+05
ID    2.305100e+05
IL    6.608586e+05
IN    5.859420e+05
KS    2.229285e+05
KY    4.701985e+05
LA    2.311102e+05
MA    3.444810e+05
MD    5.666310e+05
MI    4.324185e+05
MN    3.776095e+05
MO    3.220767e+05
MS    1.511960e+05
NC    3.789674e+05
NE    3.882445e+05
NJ    2.278950e+05
NM    5.631650e+05
NV    2.973390e+05
NY    2.209354e+06
OH    4.136376e+05
OK    5.400050e+05
OR    3.414533e+05
PA    9.424570e+05
PR    2.421565e+05
RI    1.809720e+05
SD    1.939780e+05
TN    3.389567e+05
TX    4.692099e+05
UT    2.009630e+05
VA    2.503151e+05
WA    3.163906e+05
WI    4.258305e+05